performance/tests/users.yml
execution:
  - concurrency: 1
    iterations: 10
    scenario: users-get-one
  - concurrency: 1
    iterations: 10
    scenario: users-get-all
  - concurrency: 1
    iterations: 10
    scenario: users-search-one-page
  - concurrency: 1
    iterations: 10
    scenario: users-has-right
  - concurrency: 1
    iterations: 10
    scenario: users-get-one-permission-strings
  - concurrency: 1
    iterations: 10
    scenario: users-get-one-programs
  - concurrency: 1
    iterations: 10
    scenario: users-get-one-facilities
  - concurrency: 1
    iterations: 10
    scenario: users-get-one-supervised-facilities

scenarios:
  get-user-token:
    requests:
      - url: ${__P(base-uri)}/api/oauth/token
        method: POST
        label: GetUserToken
        headers:
          Authorization: Basic ${__base64Encode(${__P(basic-auth)})}
        body:
          grant_type: password
          username: ${__P(username)}
          password: ${__P(password)}
        extract-jsonpath:
          access_token:
            jsonpath: $.access_token
  users-get-one:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/users/a337ec45-31a0-4f2b-9b2e-a105c4b669bb
        method: GET
        label: GetAdministratorUser
        headers:
          Authorization: Bearer ${access_token}
  users-get-all:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/users
        method: GET
        label: GetAllUsers
        headers:
          Authorization: Bearer ${access_token}
  users-search-one-page:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/users/search?page=1&size=10
        method: POST
        label: GetAUserPageOfTen
        body: '{}'
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  users-has-right:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/rights
        method: GET
        label: GetAllRights
        headers:
          Authorization: Bearer ${access_token}
        extract-jsonpath:
          rightUuid:
            jsonpath: $.[:1].id
        jsr223:
          script-text: |
            String uuid = vars.get("rightUuid");
            uuid = uuid.replaceAll(/"|\[|\]/, "");
            vars.put("rightUuid", uuid);
      - url: ${__P(base-uri)}/api/users/a337ec45-31a0-4f2b-9b2e-a105c4b669bb/hasRight?rightId=${rightUuid}
        method: GET
        label: AdministratorUserHasRight
        headers:
          Authorization: Bearer ${access_token}
  users-get-one-permission-strings:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/users/a337ec45-31a0-4f2b-9b2e-a105c4b669bb/permissionStrings
        method: GET
        label: GetAdministratorUserPermissionStrings
        headers:
          Authorization: Bearer ${access_token}
  users-get-one-programs:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/users/a337ec45-31a0-4f2b-9b2e-a105c4b669bb/programs
        method: GET
        label: GetAdministratorUserPrograms
        headers:
          Authorization: Bearer ${access_token}
  users-get-one-facilities:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/users/a337ec45-31a0-4f2b-9b2e-a105c4b669bb/facilities
        method: GET
        label: GetAdministratorUserFacilities
        headers:
          Authorization: Bearer ${access_token}
  users-get-one-supervised-facilities:
    requests:
      - include-scenario: get-user-token
      # Program = Family Planning, Right = REQUISITION_CREATE
      - url: ${__P(base-uri)}/api/users/a337ec45-31a0-4f2b-9b2e-a105c4b669bb/supervisedFacilities?programdI=dce17f2e-af3e-40ad-8e00-3496adef44c3&rightId=9ade922b-3523-4582-bef4-a47701f7df14
        method: GET
        label: GetAdministratorSupervisedFacilities
        headers:
          Authorization: Bearer ${access_token}

reporting:
    - module: passfail
      criteria:
        90% of get permission strings for administrator user fail to get in 500 milliseconds: p90 of GetAdministratorUserPermissionStrings>500ms
        90% of get programs for administrator user fail to get in 250 milliseconds: p90 of GetAdministratorUserPrograms>250ms
        90% of get facilities for administrator user fail to get in 500 milliseconds: p90 of GetAdministratorUserFacilities>500ms
        90% of get supervised facilities for administrator user fail to get in 500 milliseconds: p90 of GetAdministratorSupervisedFacilities>500ms